Merge branch 'priority_fix'
